; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v2 ?v9)
             (pred_8 ?v12 ?v1)
             (pred_7 ?v2 ?v1)
             (pred_3 ?v13 ?v2 )
	     (pred_12 ?v2)
             (pred_5 ?v10)
             (pred_6 ?v12)
             (pred_4 ?v1)
             (pred_11 ?v2)
             (pred_10 ?v12)
             (pred_9 ?v2)
             (pred_1 ))



(:action op_1
:parameters (?v6 ?v4 ?v3 ?v11)
:precondition (and (pred_5 ?v6) (pred_5 ?v4) (pred_6 ?v3) (pred_4 ?v11)
          (pred_2 ?v6 ?v4) (pred_8 ?v3 ?v11)
                   (pred_7 ?v4 ?v11) (pred_12 ?v6) 
                   (pred_11 ?v4) (pred_10 ?v3))
:effect (and  (pred_9 ?v4) (not (pred_11 ?v4))))


(:action op_3
:parameters (?v6 ?v5)
:precondition (and (pred_5 ?v6) (pred_5 ?v5)
               (pred_12 ?v6) (pred_2 ?v6 ?v5) (pred_9 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v6))))

(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_5 ?v6) (pred_6 ?v3) 
                  (pred_12 ?v6) (pred_3 ?v3 ?v6) (pred_1 ))
:effect (and (pred_10 ?v3)
   (not (pred_3 ?v3 ?v6)) (not (pred_1 ))))


(:action op_5
:parameters (?v6 ?v8 ?v7)
:precondition (and (pred_5 ?v6) (pred_6 ?v8) (pred_6 ?v7)
                  (pred_12 ?v6) (pred_10 ?v7) (pred_3 ?v8 ?v6))
:effect (and (pred_10 ?v8) (pred_3 ?v7 ?v6)
        (not (pred_10 ?v7)) (not (pred_3 ?v8 ?v6))))

(:action op_2
:parameters (?v6 ?v3)
:precondition (and (pred_5 ?v6) (pred_6 ?v3) 
                  (pred_12 ?v6) (pred_10 ?v3))
:effect (and (pred_1 ) (pred_3 ?v3 ?v6) (not (pred_10 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_11 obj_22 obj_12 obj_09 obj_03 obj_28 obj_21 obj_06 obj_13 obj_05 obj_31 obj_26 obj_24 obj_04 obj_07 obj_18 obj_25 obj_08 obj_23 obj_01 obj_19 obj_16 obj_15 obj_29
    obj_10 obj_27 obj_20
    obj_30 obj_17 obj_14
    )

    (:init
       (pred_1)

       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_28)
       (pred_5 obj_21)
       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_31)
       (pred_5 obj_26)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_25)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_5 obj_15)
       (pred_5 obj_29)
       (pred_4 obj_10)
       (pred_4 obj_27)
       (pred_4 obj_20)
       (pred_6 obj_30)
       (pred_6 obj_17)
       (pred_6 obj_14)

       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_11 obj_28)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_22 obj_21)
       (pred_2 obj_22 obj_12)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_22)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_03 obj_05)
       (pred_2 obj_03 obj_28)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_28 obj_31)
       (pred_2 obj_28 obj_21)
       (pred_2 obj_28 obj_11)
       (pred_2 obj_28 obj_03)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_21 obj_06)
       (pred_2 obj_21 obj_22)
       (pred_2 obj_21 obj_28)
       (pred_2 obj_06 obj_24)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_05 obj_31)
       (pred_2 obj_05 obj_03)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_31 obj_26)
       (pred_2 obj_31 obj_28)
       (pred_2 obj_31 obj_05)
       (pred_2 obj_26 obj_25)
       (pred_2 obj_26 obj_24)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_26 obj_31)
       (pred_2 obj_24 obj_08)
       (pred_2 obj_24 obj_04)
       (pred_2 obj_24 obj_06)
       (pred_2 obj_24 obj_26)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_04 obj_24)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_25)
       (pred_2 obj_18 obj_31)
       (pred_2 obj_18 obj_07)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_25 obj_08)
       (pred_2 obj_25 obj_26)
       (pred_2 obj_25 obj_18)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_23)
       (pred_2 obj_08 obj_24)
       (pred_2 obj_08 obj_25)
       (pred_2 obj_23 obj_29)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_23 obj_08)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_15 obj_29)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_29 obj_23)
       (pred_2 obj_29 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_24)
       (pred_7  obj_08 obj_10)
       (pred_7  obj_03 obj_27)
       (pred_7  obj_24 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_28)
       (pred_9 obj_21)
       (pred_9 obj_06)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_31)
       (pred_9 obj_26)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_25)
       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_29)

       (pred_8  obj_30 obj_10)
       (pred_8  obj_17 obj_27)
       (pred_8  obj_14 obj_20)
       (pred_3 obj_30 obj_06)
       (pred_3 obj_17 obj_22)
       (pred_3 obj_14 obj_15)
       (pred_12 obj_26)
    )

    (:goal (and
       (pred_3 obj_30 obj_23)
       (pred_3 obj_17 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_12)))
)
)

; plan
1. (op_3 obj_26 obj_21)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_21)
   goals met: 0 of 2
2. (op_3 obj_21 obj_22)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_22)
   goals met: 0 of 2
3. (op_4 obj_22 obj_17)
   deleted: (pred_3 obj_17 obj_22) (pred_1)
   added: (pred_10 obj_17)
   goals met: 0 of 2
4. (op_3 obj_22 obj_21)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_21)
   goals met: 0 of 2
5. (op_3 obj_21 obj_06)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_13)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_13)
   goals met: 0 of 2
7. (op_3 obj_13 obj_09)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_09)
   goals met: 0 of 2
8. (op_2 obj_09 obj_17)
   deleted: (pred_10 obj_17)
   added: (pred_1) (pred_3 obj_17 obj_09)
   goals met: 1 of 2
9. (op_3 obj_09 obj_13)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_13)
   goals met: 1 of 2
10. (op_3 obj_13 obj_06)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_06)
   goals met: 1 of 2
11. (op_4 obj_06 obj_30)
   deleted: (pred_3 obj_30 obj_06) (pred_1)
   added: (pred_10 obj_30)
   goals met: 1 of 2
12. (op_3 obj_06 obj_13)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_13)
   goals met: 1 of 2
13. (op_3 obj_13 obj_04)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_04)
   goals met: 1 of 2
14. (op_3 obj_04 obj_23)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_23)
   goals met: 1 of 2
15. (op_2 obj_23 obj_30)
   deleted: (pred_10 obj_30)
   added: (pred_1) (pred_3 obj_30 obj_23)
   goals met: 2 of 2
